export const uk = {
  header: {
    home: "Головна",
    contacts: "Контакти",
    login: "Увійти",
    register: "Зареєструватись",
    logout: "Вийти",
  },
  contactPage: {
    contacts: "Контакти",
    text: "Пошук контакту за ім'ям:",
    delete: "Видалити",
    edit: "Редагувати",
    sortAsc: "Сортувати",
    sortDesc: "Сортувати",
    emptyList: "У вас ще немає контактів",
  },
  contactForm: {
    name: "Ім'я:",
    number: "Номер телефону:",
    add: "Додати контакт",
  },
  editForm: {
    submit: "Підтвердити",
    close: "Закрити",
  },
  authForm: {
    name: "Ваше ім'я",
    email: "Ваша електронна пошта",
    password: "Ваш пароль",
    login: "Увійти",
    register: "Зареєструватись",
    registerText_1: "Зареєструйтесь, будь ласка.",
    registerText_2: "Якщо у вас вже є акаунт, ви можете ",
    registerText_3: "увійти",

    loginText_1: "Увійдіть, будь ласка.",
    loginText_2: "Якщо у вас ще немає акаунта, будь ласка ",
    loginText_3: "зареєструйтесь.",
  },

  home: {
    welcomeTextGuest: "Ласкаво просимо до книги контактів!",
    authTextGuest: "Будь ласка, зареєструйтесь або увійдіть.",
    welcomeTextUser: "Ласкаво просимо до книги контактів, ",
    authTextUser: "Тепер ви можете переглядати, додавати, видаляти контакти",
  },

  errors: {
    registerError:
      "«Помилка реєстрації. Будь ласка, перевірте свої дані та повторіть спробу!»",
    loginError:
      "Користувач не існує або неправильний пароль. Будь ласка, перевірте свої дані та повторіть спробу!",
    duplicateEmailError:
      "Користувач з такою ж поштою вже існує. Якщо це ви, будь ласка, увійдіть. Або перевірте ваші дані і спробуйте ще раз.",
  },
};
